src/test/cloudmail-api-negative-test.yml
# File: crc-negative-test.yml
# Project: Credit Repair Cloud
# File Created: Friday,  17-12-2021, 09:30 am
# Author: Karthik Hebbar A
# Last Modified: Friday, 17-12-2021, 05:58 pm
# Modified By: Karthik Hebbar A<karthik.hebbar@altorumleren.com>
# This script contains the artillery automation scripts for cloud mail api's for the negative scenario

config:
  ensure:
    max: 1000
  target: "http://10.1.1.76:9000"
  processor: "../../generic-helper.js"
  plugins:
    expect: {}
    metrics-by-endpoint:
      useOnlyRequestNames: true

  phases:
    - duration: 1
      arrivalRate: 1
    #   name: Warm up
    # - duration: 10
    #   arrivalRate: 5
    #   rampTo: 10
    #   name: Ramp up load
    # - duration: 20
    #   arrivalRate: 10
    #   name: Sustained load

scenarios:
  - name: "Functional Testing"
    flow:

      - log: "we started to create the wallet"
      - post:
          url: "/api/wallet"
          name: "Create Wallet"
          beforeRequest: "addJsonDataforCreateWallet"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponse
          expect:
            - statusCode: 201
      - log: "this is the data what we have got from the server: {{postCreateWalletResponse}}"

      - log: "we started to create the wallet with same registration number"
      - post:
          url: "/api/wallet"
          name: "Create Wallet with same registration number"
          beforeRequest: "addJsonDataforCreateWalletNegativeTest2"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponseNeagtiveTest1
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postCreateWalletResponseNeagtiveTest1}}"

      - log: "we started to create the wallet with the registration Id as alphabets"
      - post:
          url: "/api/wallet"
          name: "Create Wallet Registration Id as alphabets"
          beforeRequest: "addJsonDataforCreateWalletNegativeTest2"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponseNeagtiveTest2
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postCreateWalletResponseNeagtiveTest2}}"

      - log: "we started to create the wallet with the registration id as alpha numeric"
      - post:
          url: "/api/wallet"
          name: "Create Wallet with Registration Id as alpha numeric"
          beforeRequest: "addJsonDataforCreateWalletNegativeTest3"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponseNeagtiveTest3
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postCreateWalletResponseNeagtiveTest3}}"

      - log: "we started to create the wallet by changing the wallet type"
      - post:
          url: "/api/wallet"
          name: "Create Wallet with invalid wallet type"
          beforeRequest: "addJsonDataforCreateWalletNegativeTest4"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponseNegativeTest4
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postCreateWalletResponseNegativeTest4}}"

      - log: "we started to create the wallet by changing the wallet type with integers"
      - post:
          url: "/api/wallet"
          name: "Create Wallet with integer wallet type"
          beforeRequest: "addJsonDataforCreateWalletNegativeTest5"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponseNegativeTest5
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postCreateWalletResponseNegativeTest5}}"

      - log: "we started to create the wallet by changing the wallet type with integers and float values"
      - post:
          url: "/api/wallet"
          name: "Create Wallet with integer and float wallet type"
          beforeRequest: "addJsonDataforCreateWalletNegativeTest6"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponseNegativeTest6
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postCreateWalletResponseNegativeTest6}}"

      - log: "we started to create the wallet with invalid registration id and wallet type"
      - post:
          url: "/api/wallet"
          name: "Create Wallet with invalid registration id and wallet type"
          beforeRequest: "addJsonDataforCreateWalletNegativeTest7"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponseNegativeTest7
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postCreateWalletResponseNegativeTest7}}"

      - log: "we started to create the wallet with invalid url"
      - post:
          url: "/api/walet"
          name: "Create Wallet with invalid url 1"
          beforeRequest: "addJsonDataforCreateWallet"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponseNegativeTest8
          expect:
            - statusCode: 404
      - log: "this is the data what we have got from the server: {{postCreateWalletResponseNegativeTest8}}"

      - log: "we started to create the wallet with invalid url"
      - post:
          url: "/api/walet"
          name: "Create Wallet with invalid url 2"
          beforeRequest: "addJsonDataforCreateWallet"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postCreateWalletResponseNegativeTest9
          expect:
            - statusCode: 404
      - log: "this is the data what we have got from the server: {{postCreateWalletResponseNegativeTest9}}"

      - log: "we started to update balance"
      - post:
          url: "/api/wallet/recharge"
          name: "Update Balance"
          beforeRequest: "addJsonDataforUpdateBalance"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postUpdateBalanceResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{postUpdateBalanceResponse}}"

      - log: "we started to update balance with a amount equals to zero"
      - post:
          url: "/api/wallet/recharge"
          name: "Update Balance with a amount equals to zero"
          beforeRequest: "addJsonDataforUpdateBalanceNegativeTest1"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postUpdateBalanceResponseNegativeTest1
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postUpdateBalanceResponseNegativeTest1}}"

      - log: "we started to update balance with alpha-numeric characters in amount field"
      - post:
          url: "/api/wallet/recharge"
          name: "Update Balance with alpha-numeric characters in amount field"
          beforeRequest: "addJsonDataforUpdateBalanceNegativeTest2"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postUpdateBalanceResponseNegativeTest2
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postUpdateBalanceResponseNegativeTest2}}"

      - log: "we started to update balance without registration id"
      - post:
          url: "/api/wallet/recharge"
          name: "Update Balance without registration id"
          beforeRequest: "addJsonDataforUpdateBalanceNegativeTest3"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postUpdateBalanceResponseNegativeTest3
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postUpdateBalanceResponseNegativeTest3}}"

      - log: "we started to update balance without wallet type"
      - post:
          url: "/api/wallet/recharge"
          name: "Update Balance without wallet type"
          beforeRequest: "addJsonDataforUpdateBalanceNegativeTest4"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postUpdateBalanceResponseNegativeTest4
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postUpdateBalanceResponseNegativeTest4}}"

      - log: "we started to update balance without registration id and wallet type"
      - post:
          url: "/api/wallet/recharge"
          name: "Update Balance without registration id and wallet type"
          beforeRequest: "addJsonDataforUpdateBalanceNegativeTest5"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postUpdateBalanceResponseNegativeTest5
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postUpdateBalanceResponseNegativeTest5}}"

      - log: "we started to update balance without registration id and wallet type and invalid amount"
      - post:
          url: "/api/wallet/recharge"
          name: "Update Balance without registration id and wallet type and invalid amount"
          beforeRequest: "addJsonDataforUpdateBalanceNegativeTest6"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postUpdateBalanceResponseNegativeTest6
          expect:
            - statusCode: 422
            - contentType: json
            - hasProperty: message.registration_id
            - hasProperty: message.wallet_type
            - hasProperty: message.amount
            - equals:
              - "{{ postUpdateBalanceResponseNegativeTest6.message.registration_id }}"
              - "The registration id field is required."
            - equals: 
              - "{{ postUpdateBalanceResponseNegativeTest6.message.wallet_type }}"
              - "The wallet type field is required."
            - equals:
              - "{{ postUpdateBalanceResponseNegativeTest6.message.amount }}"
              - "The amount must be a number."
      - log: "this is the data what we have got from the server: {{postUpdateBalanceResponseNegativeTest6}}"

      - log: "we started to get the balance"
      - get:
          url: "/api/wallet/balance/{{registration_id}}/{{wallet_type}}"
          name: "Get Balance"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getBalanceResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{getBalanceResponse}}"

      - log: "we started to get the balance without registration Id"
      - get:
          url: "/api/wallet/balance/{{}}/{{wallet_type}}"
          name: "Get Balance without registration Id"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getBalanceResponseNegativeTest1
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{getBalanceResponseNegativeTest1}}"

      - log: "we started to get the balance without wallet type"
      - get:
          url: "/api/wallet/balance/{{registration_id}}/{{}}"
          name: "Get Balance without wallet type"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getBalanceResponseNegativeTest2
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{getBalanceResponseNegativeTest2}}"

      - log: "we started to get the balance without registration Id and wallet type"
      - get:
          url: "/api/wallet/balance/{{}}/{{}}"
          name: "Get Balance without registration Id and wallet Type"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getBalanceResponseNegativeTest3
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{getBalanceResponseNegativeTest3}}"

      - log: "we started to get the balance with invalid url 1"
      - get:
          url: "/apiwallet/balance/{{registration_id}}/{{wallet_type}}"
          name: "Get Balance with invalid url 1"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getBalanceResponseNegativeTest4
          expect:
            - statusCode: 404
      - log: "this is the data what we have got from the server: {{getBalanceResponseNegativeTest4}}"

      - log: "we started to get the balance with invalid url 2"
      - get:
          url: "/api/wallet/balance"
          name: "Get Balance with invalid url 2"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getBalanceResponseNegativeTest5
          expect:
            - statusCode: 404
      - log: "this is the data what we have got from the server: {{getBalanceResponseNegativeTest5}}"

      - log: "we started to get all wallets"
      - get:
          url: "/api/wallets/{{registration_id}}"
          name: "Get All Wallets"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getAllWalletResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{getAllWalletResponse}}"

      - log: "we started to get all wallets without registration Id"
      - get:
          url: "/api/wallets/{{}}"
          name: "Get All Wallets without registration Id"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getAllWalletResponseNegativeTest1
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{getAllWalletResponseNegativeTest1}}"

      - log: "we started to get all wallets with invalid url"
      - get:
          url: "/apiwallets/{{registration_id}}"
          name: "Get All Wallets with invalid url"
          # beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: getAllWalletResponseNegativeTest2
          expect:
            - statusCode: 404
      - log: "this is the data what we have got from the server: {{getAllWalletResponseNegativeTest2}}"

      - log: "we started to verify the address"
      - post:
          url: "/api/address/verify"
          name: "Verify Address"
          beforeRequest: "addJsonDataforAddressVerify"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postAddressVerifyResponse
          expect:
            - statusCode: 200
      - log: "this is the data what we have got from the server: {{postAddressVerifyResponse}}"

      - log: "we started to verify the address"
      - post:
          url: "/api/address/verify"
          name: "Verify Address"
          beforeRequest: "addJsonDataforAddressVerifyNegativeTest1"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postAddressVerifyResponseNegativeTest1
          expect:
            - statusCode: 422
      - log: "this is the data what we have got from the server: {{postAddressVerifyResponseNegativeTest1}}"

      - log: "we started to verify the address with invalid url"
      - post:
          url: "/api/addressverify"
          name: "Verify Address"
          # beforeRequest: "addJsonDataforAddressVerifyNegativeTest1"
          # afterResponse: "updateAddressId"
          capture:
            json: "$"
            as: postAddressVerifyResponse
          expect:
            - statusCode: 404
      - log: "this is the data what we have got from the server: {{postAddressVerifyResponse}}"